package Lessons.Lesson1;


//Предварительно:
//    V   1. Установите JDK
//    V   2. Установите Intellij IDEA
//    V   3. Установите SmartGit
//    V   4. Зарегистрируйте аккаунт на GitHub.com

//              Задание 1
//    V   1. Создайте новый репозиторий (проект) на GitHub
//    V   2. Синхронизируйте локальную папку на компьютере с проектом на GitHub с помощью Git.
//    V   3. Надо взять ссылку на репозиторий с GitHub, в SmartGit нажать Repository потом Clone.
//    V   4. Добавить .gitignore
//    V   5. Создайте новый проект в Intellij IDEA в ранее созданной папке.

public class Main {
    public static void main(String[] args) {
        FirTree();
        System.out.println("\n\n******************************\n\n");
        AnotherPicture();
    }

//
//        Задание 2
//        Напишите программу которая рисует елочку в консоль.
//              /\
//             /  \
//            / || \
//           /  ||  \
//          /   ||   \
//         /    ||    \
//        /     ||     \
//              ||
//        ---------------

    public static void FirTree () {
        System.out.println("      /\\\n     /  \\\n    / || \\\n   /  ||  \\\n  /   ||   \\\n /    ||    \\\n" +
                "/     ||     \\\n      ||\n--------------");
    }

//        Задание 3
//        Пусть ваша программа нарисует сложный рисунок в консоль, на ваше усмотрение, что угодно с этого сайта
//        http://www.messletters.com/en/text-art/

    public static void AnotherPicture () {
        System.out.println("¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶¶¶¶¶1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶§§§1§§¶¶\n" +
                "¶¶¶¶¶¶_§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶§1___1§§¶¶¶¶¶\n" +
                "¶¶¶¶§__¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶§1______§¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶§___¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶§§1_______1§¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶____1¶¶¶¶¶¶¶¶¶¶§11_________1¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶_______11111____________§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶____________________§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶_______________1§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶__________1§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶\n" +
                "¶¶¶¶¶¶§§§¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶");
    }
//
//        Задание 4
//        Добавьте кого-то с вашей группы в список collaborators вашего репозитория на GitHub. Это можно сделать на странице вашего репозитория.
//        Дать ссылку на репозиторий вашему одногруппнику. Чтобы он подключился ваш проект себе.
//        Убедиться что проект работает у вас и у вашего напарника.
//        Пусть напарник внесет изменения и сделает commit и push на репозиторий, после чего сделайте pull и заберите изменения с репозитория.
//        Убедитесь что у вас появились изменения который внес ваш напарник.



}