package Lessons.Lesson1.HomeWork1;

public class MySummer {
    public static void main(String[] args) {
        System.out.println("\t\t\t\tКак я провел лето 2017.\n\tПривет, меня зовут Алекс. Мне 37 лет и у меня 4 детей.\n" +
                "Я, среднестатистический многодетный отец и большенство времени провожу на работе. Но, когда приходят выходные,\n" +
                "я стараюсь по максимуму уделить время детям. Этим летом мы вмете катались на роликах, выбирались на велосипедах \n" +
                "в лес. У детей также есть футбольный мяч и пару раз нам удалось выбраться на стадион с друзьями чтоб \"погонять\"\n" +
                "его по траве. Из-за того, что мы находимся далековато от города, всего раз в месяц смогли посетить веревочный \n" +
                "городок, где дети отрывались по полной. Так же, недалеко от нас, есть озеро, где мы все любим купаться. Дети у \n" +
                "меня \"водоплавающие\", поэтому домой всегда идут с неохотой. Я считаю, что отдых этим летом удался на славу.");
    }
}
